Revit 2027 API
Application.IsSystemsEnabled Property
 Checks whether or not any systems disciplines (mechanical, electrical, or piping) are enabled.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSystemsEnabled { get; }
Public ReadOnly Property IsSystemsEnabled As Boolean
	Get
public:
property bool IsSystemsEnabled {
	bool get ();
}
member IsSystemsEnabled : bool with get
Property Value
Boolean
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace